SJoyTheHawk/ESP32P4_video_transmission/mipi_csi_camera/mipi_csi_camera.ino
/**
 * OV5647 MIPI-CSI to RTSP/RTP-JPEG prototype for ESP32-P4.
 *
 * RTSP control uses TCP port 554. RFC 2435 RTP/JPEG media uses UDP port
 * 5430 and RTCP reports are accepted and discarded on UDP port 5431.
 */

// #define EXCLUDE_WIFI  // Uncomment for camera-only bring-up.

#include "Arduino.h"
#include <ESP_Video.h>
#include <errno.h>
#include <esp_heap_caps.h>
#include "capture_controller.h"
#include "jpeg_output_buffer.h"
#include "photo_store.h"
#include "photo_api.h"
#include "settings_manager.h"

#ifndef EXCLUDE_WIFI
#include <WiFi.h>
#include "src/rtsp_server/ESP32-RTSPServer.h"
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
#if CONFIG_IDF_TARGET_ESP32P4
#define EXAMPLE_MIPI_CSI_SCCB_I2C_PORT     0
#define EXAMPLE_MIPI_CSI_SCCB_I2C_SCL_PIN 29
#define EXAMPLE_MIPI_CSI_SCCB_I2C_SDA_PIN 28
#define EXAMPLE_MIPI_CSI_SCCB_I2C_FREQ     100000
#define EXAMPLE_MIPI_CSI_SENSOR_RESET_PIN  26
#define EXAMPLE_MIPI_CSI_SENSOR_PWDN_PIN   27

#ifndef EXCLUDE_WIFI
#define EXAMPLE_C6_SDIO_D0_PIN  49
#define EXAMPLE_C6_SDIO_D1_PIN  50
#define EXAMPLE_C6_SDIO_D2_PIN  51
#define EXAMPLE_C6_SDIO_D3_PIN  52
#define EXAMPLE_C6_SDIO_CMD_PIN 53
#define EXAMPLE_C6_SDIO_CLK_PIN 54
#define EXAMPLE_C6_WAKE_PIN     12
#define EXAMPLE_C6_ENABLE_PIN   19

// const char *kWifiSsid = "XIMS2";
// const char *kWifiPassword = "Ns203Ns203.";
const char *kWifiSsid = "South Park";
const char *kWifiPassword = "qwerasdf";
const uint32_t kWifiConnectTimeoutMs = 15000;
const uint32_t kWifiReconnectIntervalMs = 5000;
const uint16_t kRtspPort = 554;
const uint16_t kRtpVideoPort = 5430;
#endif
#else
#error "The selected target SoC is not supported"
#endif

struct MemorySnapshot {
  size_t heap_free;
  size_t heap_largest;
  size_t psram_free;
  size_t psram_largest;
};

ESPVideoClass video;
CaptureController capture_controller;
PhotoStore photo_store;
PhotoApi photo_api;
SettingsManager settings_manager;
CameraSettings settings;

static bool capturePhotoForApi(void *) {
  HighResStillCandidate candidate;
  if (!capture_controller.capture1080pStill(&candidate)) {
    return false;
  }
  DetachedJpegOutputBuffer detached = candidate.jpeg;
  candidate.jpeg = {};
  PhotoBlob *photo = PhotoBlob::create(
    detached, candidate.size, candidate.width, candidate.height,
    candidate.quality, candidate.captured_ms);
  if (photo == nullptr) {
    return false;
  }
  return photo_store.publish(photo);
}

// Keep this identifier stable within a phase so serial logs can be matched to
// the implementation and build format that produced them.
static constexpr char kImplementationVersion[] = "v3.0-phase8-arduino";
const size_t kCaptureBufferCount = 2;
const uint32_t kJpegQuality = 50;
const uint32_t kJpegIntervalMs = 100;
const uint32_t kBaselineReportIntervalMs = 5000;
const uint32_t kCaptureDequeueTimeoutMs = 5000;
const uint32_t kLifecycleTestCycles = 100;
const uint32_t kHighResValidationCycles = 20;
const uint32_t kPhotoStoreReplacementCycles = 100;
const uint32_t kPhotoStoreReaderCount = 5;
const size_t kStillJpegCapacity = 2 * 1024 * 1024;

static MemorySnapshot captureMemorySnapshot() {
  return {
    ESP.getFreeHeap(),
    ESP.getMaxAllocHeap(),
    ESP.getFreePsram(),
    heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM),
  };
}

static void logMemoryBaseline(const char *milestone) {
  Serial.printf(
    "memory milestone=%s heap_free=%lu heap_largest=%lu "
    "psram_total=%lu psram_free=%lu psram_largest=%lu\n",
    milestone,
    static_cast<unsigned long>(ESP.getFreeHeap()),
    static_cast<unsigned long>(ESP.getMaxAllocHeap()),
    static_cast<unsigned long>(ESP.getPsramSize()),
    static_cast<unsigned long>(ESP.getFreePsram()),
    static_cast<unsigned long>(
      heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM)));
}

static bool logSensorIdentity() {
#if CONFIG_CAMERA_OV5647 && \
    CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR
  if (!video.isCSIInitialized()) {
    Serial.println("sensor identity status=failed reason=csi-not-initialized");
    return false;
  }

  // video.begin() succeeds only after the OV5647 driver reads and validates
  // chip-ID registers 0x300a and 0x300b.
  Serial.println(
    "sensor identity status=confirmed pid=0x5647 "
    "source=esp-video-register-probe");
  return true;
#else
  Serial.println(
    "sensor identity status=unverified reason=ov5647-autodetect-disabled");
  return false;
#endif
}

// Kept only as Phase 2 source history until the Phase 3 hardware gate passes.
// All active V4L2 ownership is now in CaptureController.
#if 0
static bool probeVgaOutputFormat(int fd,
                                 const struct v4l2_format &original_format) {
  if (original_format.fmt.pix.width == kVgaWidth
      && original_format.fmt.pix.height == kVgaHeight) {
    Serial.println(
      "vga probe status=supported path=active-sensor-mode output=640x480");
    return true;
  }

  struct v4l2_format requested_format = original_format;
  requested_format.fmt.pix.width = kVgaWidth;
  requested_format.fmt.pix.height = kVgaHeight;
  errno = 0;
  const int set_result = ioctl(fd, VIDIOC_S_FMT, &requested_format);
  const int set_errno = errno;

  struct v4l2_format actual_format = {};
  actual_format.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  const bool readback_ready = ioctl(fd, VIDIOC_G_FMT, &actual_format) == 0;
  const bool supported = set_result == 0 && readback_ready
                         && actual_format.fmt.pix.width == kVgaWidth
                         && actual_format.fmt.pix.height == kVgaHeight;

  Serial.printf(
    "vga probe status=%s requested=%lux%lu actual=%lux%lu "
    "set_result=%d errno=%d next=%s\n",
    supported ? "supported" : "unsupported",
    static_cast<unsigned long>(kVgaWidth),
    static_cast<unsigned long>(kVgaHeight),
    static_cast<unsigned long>(
      readback_ready ? actual_format.fmt.pix.width : 0),
    static_cast<unsigned long>(
      readback_ready ? actual_format.fmt.pix.height : 0),
    set_result, set_errno,
    supported ? "validate-hardware-output" : "add-sensor-mode");

