SJoyTheHawk/ESP32P4_video_transmission/mipi_csi_camera/mipi_csi_camera.ino
  if (set_result == 0) {
    struct v4l2_format restore_format = original_format;
    if (ioctl(fd, VIDIOC_S_FMT, &restore_format) != 0) {
      Serial.printf("vga probe restore=failed errno=%d\n", errno);
      return false;
    }
    Serial.println("vga probe restore=ready");
  }
  return supported;
}

static bool configureCaptureDequeueTimeout(int fd) {
  struct timeval requested = {};
  requested.tv_sec = kCaptureDequeueTimeoutMs / 1000;
  requested.tv_usec = (kCaptureDequeueTimeoutMs % 1000) * 1000;

  errno = 0;
  const int set_result = ioctl(fd, VIDIOC_S_DQBUF_TIMEOUT, &requested);
  const int set_errno = errno;

  struct timeval actual = {};
  errno = 0;
  const int get_result = ioctl(fd, VIDIOC_G_DQBUF_TIMEOUT, &actual);
  const int get_errno = errno;
  const uint64_t actual_us = static_cast<uint64_t>(actual.tv_sec) * 1000000
                             + actual.tv_usec;
  const uint64_t requested_us =
    static_cast<uint64_t>(kCaptureDequeueTimeoutMs) * 1000;
  const bool ready = set_result == 0 && get_result == 0
                     && actual_us == requested_us;

  Serial.printf(
    "capture timeout status=%s requested_ms=%lu actual_us=%llu "
    "set_result=%d set_errno=%d get_result=%d get_errno=%d "
    "driver_timeout_errno=EPERM app_timeout_errno=ETIMEDOUT\n",
    ready ? "configured" : "failed",
    static_cast<unsigned long>(kCaptureDequeueTimeoutMs), actual_us,
    set_result, set_errno, get_result, get_errno);
  return ready;
}
#endif

static bool runJpegResourceLifecycleTest() {
  bool allocation_cycles_ready = true;
  bool encoder_cycles_ready = true;
  bool detach_ready = false;

  // Warm up lazy driver allocations before taking the comparison baseline.
  {
    JpegOutputBuffer output;
    allocation_cycles_ready = output.allocate(kStillJpegCapacity);
  }
  jpeg_encode_engine_cfg_t engine_config = {};
  engine_config.timeout_ms = 40;
  jpeg_encoder_handle_t warmup_handle = nullptr;
  if (jpeg_new_encoder_engine(&engine_config, &warmup_handle) == ESP_OK) {
    encoder_cycles_ready = jpeg_del_encoder_engine(warmup_handle) == ESP_OK;
  } else {
    encoder_cycles_ready = false;
  }

  const MemorySnapshot before = captureMemorySnapshot();
  for (uint32_t cycle = 0;
       cycle < kLifecycleTestCycles && allocation_cycles_ready; ++cycle) {
    JpegOutputBuffer output;
    allocation_cycles_ready = output.allocate(kStillJpegCapacity)
                              && output.capacity() >= kStillJpegCapacity;
  }

  for (uint32_t cycle = 0;
       cycle < kLifecycleTestCycles && encoder_cycles_ready; ++cycle) {
    jpeg_encoder_handle_t handle = nullptr;
    encoder_cycles_ready =
      jpeg_new_encoder_engine(&engine_config, &handle) == ESP_OK;
    if (encoder_cycles_ready) {
      encoder_cycles_ready = jpeg_del_encoder_engine(handle) == ESP_OK;
    }
  }

  {
    JpegOutputBuffer output;
    if (output.allocate(4096)) {
      DetachedJpegOutputBuffer detached = output.detach();
      detach_ready = !output.valid() && output.capacity() == 0
                     && detached.data != nullptr && detached.capacity >= 4096;
      free(detached.data);
      output.release();
    }
  }

  const MemorySnapshot after = captureMemorySnapshot();
  const bool memory_ready = after.heap_free >= before.heap_free
                            && after.heap_largest >= before.heap_largest
                            && after.psram_free >= before.psram_free
                            && after.psram_largest >= before.psram_largest;
  const bool ready = allocation_cycles_ready && encoder_cycles_ready
                     && detach_ready && memory_ready;

  Serial.printf(
    "jpeg lifecycle status=%s cycles=%lu capacity=%lu "
    "alloc_release=%s engine_create_destroy=%s detach=%s "
    "heap_free_before=%lu heap_free_after=%lu "
    "heap_largest_before=%lu heap_largest_after=%lu "
    "psram_free_before=%lu psram_free_after=%lu "
    "psram_largest_before=%lu psram_largest_after=%lu\n",
    ready ? "passed" : "failed",
    static_cast<unsigned long>(kLifecycleTestCycles),
    static_cast<unsigned long>(kStillJpegCapacity),
    allocation_cycles_ready ? "passed" : "failed",
    encoder_cycles_ready ? "passed" : "failed",
    detach_ready ? "passed" : "failed",
    static_cast<unsigned long>(before.heap_free),
    static_cast<unsigned long>(after.heap_free),
    static_cast<unsigned long>(before.heap_largest),
    static_cast<unsigned long>(after.heap_largest),
    static_cast<unsigned long>(before.psram_free),
    static_cast<unsigned long>(after.psram_free),
    static_cast<unsigned long>(before.psram_largest),
    static_cast<unsigned long>(after.psram_largest));
  return ready;
}

#if 0
static bool logCameraBaseline() {
  const int fd = open(ESP_VIDEO_MIPI_CSI_DEVICE_NAME, O_RDWR);
  if (fd < 0) {
    Serial.println("baseline: failed to open CSI video device");
    return false;
  }

  esp_cam_sensor_format_t sensor_format = {};
  const bool sensor_format_ready =
    ioctl(fd, VIDIOC_G_SENSOR_FMT, &sensor_format) == 0;
  if (sensor_format_ready) {
    const char *name = sensor_format.name == nullptr
                       ? "unnamed" : sensor_format.name;
    Serial.printf(
      "sensor baseline mode=%s output=%ux%u format=%d fps=%u xclk=%d "
      "mipi_clk=%lu lanes=%lu\n",
      name, sensor_format.width, sensor_format.height,
      static_cast<int>(sensor_format.format), sensor_format.fps,
      sensor_format.xclk,
      static_cast<unsigned long>(sensor_format.mipi_info.mipi_clk),
      static_cast<unsigned long>(sensor_format.mipi_info.lane_num));
  } else {
    Serial.println("baseline: failed to read active sensor format");
  }

  struct v4l2_format video_format = {};
  video_format.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  const bool video_format_ready = ioctl(fd, VIDIOC_G_FMT, &video_format) == 0;
  if (video_format_ready) {
    Serial.printf(
      "video baseline width=%lu height=%lu fourcc=" V4L2_FMT_STR
      " bytes_per_line=%lu size_image=%lu\n",
      static_cast<unsigned long>(video_format.fmt.pix.width),
      static_cast<unsigned long>(video_format.fmt.pix.height),
      V4L2_FMT_STR_ARG(video_format.fmt.pix.pixelformat),
      static_cast<unsigned long>(video_format.fmt.pix.bytesperline),
      static_cast<unsigned long>(video_format.fmt.pix.sizeimage));
  } else {
    Serial.println("baseline: failed to read active video format");
  }

  if (video_format_ready) {
    probeVgaOutputFormat(fd, video_format);
  }
  close(fd);
  return sensor_format_ready && video_format_ready;
}

// ESP-Video resets the per-device timeout on every open.  Configure a second
// reference after capture_dev.begin() so the setting remains on the shared
// driver object while capture_dev owns its descriptor.
static bool configureActiveCaptureDequeueTimeout() {
  const int fd = open(ESP_VIDEO_MIPI_CSI_DEVICE_NAME, O_RDWR);
  if (fd < 0) {
    Serial.printf("capture timeout status=failed open_errno=%d\n", errno);
    return false;
  }

  const bool ready = configureCaptureDequeueTimeout(fd);
  close(fd);
  return ready;
}

static bool runCaptureTimeoutRecoveryTest() {
  ESPVideoBufferClass held[kCaptureBufferCount];
  size_t held_count = 0;
  uint32_t timeout_elapsed_us = 0;
  int driver_errno = 0;
  bool timeout_observed = false;

  // Some sensor/driver combinations expose only one ready buffer at a time.
  // Treat the first failed dequeue after at least one held buffer as the
  // starvation event; if both buffers are ready, perform one extra dequeue.
  while (held_count < kCaptureBufferCount) {
    const uint32_t start_us = micros();
    errno = 0;
    ESPVideoBufferClass candidate = capture_dev.captureBuffer();
    const uint32_t elapsed_us = micros() - start_us;
    if (!candidate.valid()) {
      if (held_count == 0) {
        Serial.printf("capture timeout test status=failed stage=hold-buffer index=0 errno=%d\n",
                      errno);
        return false;
      }
      timeout_elapsed_us = elapsed_us;
      driver_errno = errno;
      timeout_observed = true;
      break;
    }
    held[held_count++] = static_cast<ESPVideoBufferClass &&>(candidate);
  }

  if (!timeout_observed) {
    const uint32_t start_us = micros();
    errno = 0;
    ESPVideoBufferClass timed_out = capture_dev.captureBuffer();
    timeout_elapsed_us = micros() - start_us;
    driver_errno = errno;
    timeout_observed = !timed_out.valid();
  }

  const bool bounded = timeout_observed
                       && timeout_elapsed_us >= 4500000U
                       && timeout_elapsed_us <= 6500000U;
  const bool expected_driver_result = driver_errno == EPERM
                                      || driver_errno == ETIMEDOUT;

  for (size_t i = 0; i < held_count; ++i) {
    held[i].end();
  }

