SJoyTheHawk/ESP32P4_video_transmission/mipi_csi_camera/mipi_csi_camera.ino
  ESPVideoBufferClass recovery = capture_dev.captureBuffer();
  const bool recovered = recovery.valid();
  if (recovered) {
    recovery.end();
  }

  const bool ready = bounded && expected_driver_result && recovered;
  Serial.printf(
    "capture timeout test status=%s injection=hold-available-buffers "
    "requested_ms=%lu elapsed_ms=%llu held_buffers=%u driver_errno=%d reported_errno=%d "
    "stream_started=%s recovery_frame=%s\n",
    ready ? "passed" : "failed",
    static_cast<unsigned long>(kCaptureDequeueTimeoutMs),
    static_cast<unsigned long long>(timeout_elapsed_us / 1000),
    static_cast<unsigned>(held_count), driver_errno,
    (bounded && expected_driver_result) ? ETIMEDOUT : driver_errno,
    capture_dev.isCaptureStarted() ? "yes" : "no",
    recovered ? "valid" : "invalid");
  return ready;
}
#endif

#ifndef EXCLUDE_WIFI
RTSPServer rtsp_server;
bool rtsp_server_ready = false;
bool firmware_ready = false;
uint32_t last_wifi_reconnect_ms = 0;
uint32_t stream_sequence = 0;
uint32_t dropped_frames = 0;
uint32_t maximum_send_us = 0;
uint32_t maximum_cycle_us = 0;
uint32_t baseline_window_start_ms = 0;
uint32_t baseline_window_frames = 0;
uint32_t baseline_window_dropped_start = 0;
uint64_t baseline_window_jpeg_bytes = 0;
uint64_t baseline_window_capture_us = 0;
uint64_t baseline_window_encode_us = 0;
uint64_t baseline_window_send_us = 0;

static void recordBaselineFrame(uint32_t jpeg_size, uint32_t capture_us,
                                uint32_t encode_us, uint32_t send_us) {
  const uint32_t now = millis();
  if (baseline_window_start_ms == 0) {
    baseline_window_start_ms = now;
    baseline_window_dropped_start = dropped_frames;
  }

  ++baseline_window_frames;
  baseline_window_jpeg_bytes += jpeg_size;
  baseline_window_capture_us += capture_us;
  baseline_window_encode_us += encode_us;
  baseline_window_send_us += send_us;

  const uint32_t elapsed_ms = now - baseline_window_start_ms;
  if (elapsed_ms < kBaselineReportIntervalMs || baseline_window_frames == 0) {
    return;
  }

  const uint32_t fps_x100 = static_cast<uint32_t>(
    (static_cast<uint64_t>(baseline_window_frames) * 100000) / elapsed_ms);
  Serial.printf(
    "baseline window_ms=%lu frames=%lu fps=%lu.%02lu "
    "avg_jpeg_bytes=%llu avg_capture_us=%llu avg_encode_us=%llu "
    "avg_send_us=%llu dropped=%lu\n",
    static_cast<unsigned long>(elapsed_ms),
    static_cast<unsigned long>(baseline_window_frames),
    static_cast<unsigned long>(fps_x100 / 100),
    static_cast<unsigned long>(fps_x100 % 100),
    baseline_window_jpeg_bytes / baseline_window_frames,
    baseline_window_capture_us / baseline_window_frames,
    baseline_window_encode_us / baseline_window_frames,
    baseline_window_send_us / baseline_window_frames,
    static_cast<unsigned long>(dropped_frames - baseline_window_dropped_start));

  baseline_window_start_ms = now;
  baseline_window_frames = 0;
  baseline_window_dropped_start = dropped_frames;
  baseline_window_jpeg_bytes = 0;
  baseline_window_capture_us = 0;
  baseline_window_encode_us = 0;
  baseline_window_send_us = 0;
}

static bool initializeWirelessLink() {
#if CONFIG_ESP_HOSTED_ENABLED
  pinMode(EXAMPLE_C6_WAKE_PIN, OUTPUT);
  digitalWrite(EXAMPLE_C6_WAKE_PIN, HIGH);

  if (!WiFi.setPins(
        EXAMPLE_C6_SDIO_CLK_PIN,
        EXAMPLE_C6_SDIO_CMD_PIN,
        EXAMPLE_C6_SDIO_D0_PIN,
        EXAMPLE_C6_SDIO_D1_PIN,
        EXAMPLE_C6_SDIO_D2_PIN,
        EXAMPLE_C6_SDIO_D3_PIN,
        EXAMPLE_C6_ENABLE_PIN)) {
    Serial.println("failed to configure ESP-Hosted SDIO pins");
    return false;
  }
  // Configure this before STA.begin() so Arduino applies WIFI_PS_NONE on the
  // STA-start event. RTP/JPEG is emitted in short UDP bursts and needs the C6
  // radio awake to reduce observed packet loss.
  if (!WiFi.setSleep(false)) {
    Serial.println("failed to disable Wi-Fi modem power save");
    return false;
  }
  Serial.println("Wi-Fi modem power save: disabled");
  if (!WiFi.STA.begin()) {
    Serial.println("failed to initialize ESP-Hosted Wi-Fi transport");
    return false;
  }

  Serial.println("ESP-Hosted SDIO transport initialized");
  if (kWifiSsid[0] == '\0') {
    Serial.println("set kWifiSsid and kWifiPassword before the Wi-Fi test");
    return false;
  }

  Serial.printf("connecting to Wi-Fi SSID '%s'\n", kWifiSsid);
  if (!WiFi.STA.connect(kWifiSsid, kWifiPassword)) {
    Serial.println("failed to start Wi-Fi association");
    return false;
  }

  const uint32_t start = millis();
  while (WiFi.STA.status() != WL_CONNECTED
         && millis() - start < kWifiConnectTimeoutMs) {
    delay(250);
  }
  if (WiFi.STA.status() != WL_CONNECTED) {
    Serial.printf("Wi-Fi connection timeout, status=%d\n", WiFi.STA.status());
    return false;
  }

  Serial.print("Wi-Fi connected, IP=");
  Serial.println(WiFi.STA.localIP());
  return true;
#else
  Serial.println("ESP-Hosted support is disabled in this Arduino core");
  return false;
#endif
}

static bool startRtspServer() {
  if (!rtsp_server.init(RTSPServer::VIDEO_ONLY, kRtspPort, 0,
                        kRtpVideoPort)) {
    Serial.println("failed to start RTSP server");
    return false;
  }

  Serial.print("RTSP/RTP-JPEG stream ready: rtsp://");
  Serial.print(WiFi.STA.localIP());
  Serial.printf(":%u/\n", kRtspPort);
  return true;
}

static void serviceWirelessLink() {
  if (WiFi.STA.status() == WL_CONNECTED) {
    if (!rtsp_server_ready) {
      rtsp_server_ready = startRtspServer();
    }
    return;
  }

  if (rtsp_server_ready) {
    Serial.println("Wi-Fi lost; stopping RTSP server");
    rtsp_server.deinit();
    rtsp_server_ready = false;
  }

  const uint32_t now = millis();
  if (now - last_wifi_reconnect_ms < kWifiReconnectIntervalMs) {
    return;
  }
  last_wifi_reconnect_ms = now;
  Serial.println("reconnecting Wi-Fi");
  WiFi.STA.connect(kWifiSsid, kWifiPassword);
}

#endif

void setup() {
  Serial.begin(115200);
  delay(200);

  Serial.println();
  Serial.println("OV5647 UDP RTSP/RTP-JPEG prototype");
  Serial.printf("implementation version=%s\n", kImplementationVersion);
  logMemoryBaseline("boot");

#ifndef EXCLUDE_WIFI
  const bool wireless_ready = initializeWirelessLink();
  Serial.printf("wireless validation: %s\n",
                wireless_ready ? "ready" : "not ready");
  if (!wireless_ready) {
    return;
  }
  logMemoryBaseline("wifi-ready");
#endif

  ESPVideoCamConfigClass cam_config;
  if (!cam_config.begin(
        EXAMPLE_MIPI_CSI_SCCB_I2C_PORT,
        EXAMPLE_MIPI_CSI_SCCB_I2C_SCL_PIN,
        EXAMPLE_MIPI_CSI_SCCB_I2C_SDA_PIN,
        EXAMPLE_MIPI_CSI_SCCB_I2C_FREQ,
        EXAMPLE_MIPI_CSI_SENSOR_RESET_PIN,
        EXAMPLE_MIPI_CSI_SENSOR_PWDN_PIN)) {
    Serial.println("failed to configure camera pins");
    return;
  }

  ESPVideoCSIConfigClass csi_config;
  if (!csi_config.begin(cam_config)) {
    Serial.println("failed to configure CSI camera");
    return;
  }
  if (!video.begin(csi_config)) {
    Serial.println("failed to init CSI camera");
    return;
  }
  Serial.printf("CSI camera initialized: %s\n",
                video.isCSIInitialized() ? "yes" : "no");
  logSensorIdentity();
  if (!runJpegResourceLifecycleTest()) {
    Serial.println("Phase 2 gate failed: JPEG resource lifecycle");
    return;
  }

  if (!capture_controller.beginBaseline(ESP_VIDEO_MIPI_CSI_DEVICE_NAME,
                                        kCaptureBufferCount, kJpegQuality,
                                        kCaptureDequeueTimeoutMs)) {
    Serial.println("Phase 3 gate failed: controller baseline startup");
    return;
  }
  Serial.printf(
    "capture controller baseline width=%lu height=%lu format=%s buffers=%u state=%s\n",
    static_cast<unsigned long>(capture_controller.width()),
    static_cast<unsigned long>(capture_controller.height()),
    capture_controller.formatName(), static_cast<unsigned>(kCaptureBufferCount),
    capture_controller.stateName());
  logMemoryBaseline("camera-initialized");
  logMemoryBaseline("capture-buffers-ready");

  if (!capture_controller.runTimeoutRecoveryTest()) {
    Serial.println("Phase 2 gate failed: bounded dequeue timeout recovery");
    return;
  }
  if (!capture_controller.runRestartValidation(3)) {
    Serial.println("Phase 3 gate failed: controller restart validation");
    return;
  }
  if (!capture_controller.run1080pCaptureValidation(kHighResValidationCycles)) {
    Serial.println("Phase 4 gate failed: 1080p capture and baseline restoration");
    return;
  }
  if (!runPhotoStoreValidation(kPhotoStoreReplacementCycles,
                               kPhotoStoreReaderCount)) {
    Serial.println("Phase 5 gate failed: photo store ownership validation");
    return;
  }
  if (!photo_api.begin(&photo_store, capturePhotoForApi)) {
    Serial.println("Phase 6 gate failed: HTTP photo API startup");
    return;
  }
  photo_api.setCaptureController(&capture_controller);
  Serial.println("HTTP photo API ready: port=80 routes=/api/photo/*,/api/stream/*");
  Serial.printf("JPEG baseline quality=%lu interval_ms=%lu target_fps=%lu\n",
                static_cast<unsigned long>(kJpegQuality),
                static_cast<unsigned long>(kJpegIntervalMs),
                static_cast<unsigned long>(1000 / kJpegIntervalMs));
  logMemoryBaseline("jpeg-encoder-ready");

  // Phase 8: Load and apply saved settings
  if (!settings_manager.begin()) {
    Serial.println("settings_manager: failed to initialize, using defaults");
    settings.setDefaults();
  } else if (!settings_manager.loadSettings(settings)) {
    Serial.println("settings: no saved settings found, using defaults");
    settings.setDefaults();
    settings_manager.saveSettings(settings);
  } else {
    Serial.printf("settings: loaded from NVS resolution=%s quality=%u\n",
                  capture_controller.resolutionName(settings.stream_resolution),
                  settings.jpeg_quality);

    // Apply saved resolution if different from default
    if (settings.stream_resolution != StreamResolution::XVGA_800x800) {
      if (capture_controller.switchResolution(settings.stream_resolution)) {
        Serial.printf("settings: restored resolution to %s (%ux%u)\n",
                      capture_controller.resolutionName(settings.stream_resolution),
                      capture_controller.width(),
                      capture_controller.height());
      } else {
        Serial.println("settings: failed to restore resolution, staying at default");
        settings.stream_resolution = StreamResolution::XVGA_800x800;
        settings_manager.saveSettings(settings);
      }
    }
  }
  photo_api.setSettingsManager(&settings_manager, &settings);

#ifndef EXCLUDE_WIFI
  rtsp_server_ready = startRtspServer();
  firmware_ready = true;
#else
  Serial.println("camera ready; RTSP server excluded");
#endif
}

void loop() {
  if (Serial.available() > 0) {
    const int command = Serial.read();
    if (command == 'u' || command == 'U') {
      photo_api.setUnavailableForTest();
      Serial.println("photo API test state=unavailable");
    } else if (command == 'r' || command == 'R') {
      photo_api.restoreReadyForTest();
      Serial.println("photo API test state=ready");
    } else if (command == 'w' || command == 'W') {
      Serial.println("Switching to WVGA (800x640)...");
      if (capture_controller.switchResolution(StreamResolution::WVGA_800x640)) {
        Serial.printf("Resolution switch success: now running at %ux%u\n",
                     capture_controller.width(), capture_controller.height());
      } else {
        Serial.println("Resolution switch failed");
      }
    } else if (command == 'x' || command == 'X') {
      Serial.println("Switching to XVGA (800x800)...");
      if (capture_controller.switchResolution(StreamResolution::XVGA_800x800)) {
        Serial.printf("Resolution switch success: now running at %ux%u\n",
                     capture_controller.width(), capture_controller.height());
      } else {
        Serial.println("Resolution switch failed");
      }
    } else if (command == 'q' || command == 'Q') {
      Serial.printf("Current resolution: %s (%ux%u)\n",
                   capture_controller.resolutionName(
                     capture_controller.getCurrentResolution()),
                   capture_controller.width(),
                   capture_controller.height());
    } else if (command == 'p' || command == 'P') {
      Serial.println("Switching to Portrait (800x1280)...");
      if (capture_controller.switchResolution(StreamResolution::Portrait_800x1280)) {
        Serial.printf("Resolution switch success: now running at %ux%u\n",
                     capture_controller.width(), capture_controller.height());
      } else {
        Serial.println("Resolution switch failed");
      }
    }
  }
#ifndef EXCLUDE_WIFI
  if (!firmware_ready) {
    delay(1000);
    return;
  }
  serviceWirelessLink();
  if (!rtsp_server_ready || !rtsp_server.readyToSendFrame()) {
    delay(10);
    return;
  }

  const uint32_t frame_start_ms = millis();
  const uint32_t cycle_start_us = micros();
  const uint32_t capture_start_us = micros();
  errno = 0;
  CaptureController::BaselineFrame frame = capture_controller.captureBaselineFrame();
  const uint32_t capture_us = micros() - capture_start_us;
  const int capture_errno = errno;
  if (!frame.valid()) {
    ++dropped_frames;
    Serial.printf(
      "failed to capture buffer errno=%d "
      "capture_us=%lu\n",
      capture_errno,
      static_cast<unsigned long>(capture_us));
    delay(1);
    return;
  }

